[
  {
    "id": 1,
    "titulo": "Slash Quest é bom?",
    "titulo2": "Nossa análise",
    "titulo4": "Conclusão",
    "texto": "Slash Quest é uma aventura de ação com controles não convencionais e heróis improváveis. Uma espada falante precisa da sua ajuda para se reunir com sua dona, a Rainha. Gire, lute e tropece em um mundo intrigante cheio de quebra-cabeças, segredos e amigos. Esqueça sua fantasia de poder. Os controles simples, mas desconhecidos, de Slash Quest colocarão você na pele de um cavaleiro improvável com um grande coração, uma arma ainda maior e absolutamente nenhuma habilidade.",
    "imagem1": "/assets/img/1/img1.png",
    "video": "https://www.youtube.com/embed/VMEN9-kQCW8",
    "imagem2": "",
    "autor": "Arthur",
    "tempo": "4",
    "data": "17/06/2024",
    "texto2": "Joguei Slash Quest, desenvolvido pela empresa Noodle Cake Studios. O jogo promete uma experiência diferente e cativante no universo mobile.Os gráficos de Slash Quest são simples e bonitos. A trilha sonora, porém, não é o ponto forte do jogo: é simples e não tem nada de especial. No meio da nossa jornada, encontramos alguns chefes um pouco mais desafiadores, mas ainda assim fáceis de derrotar. Há alguns desafios e minijogos que concedem mais dinheiro para comprar melhorias para nossa protagonista. No entanto, isso não se torna tão necessário para avançar na história, mas traz uma maior variedade para o jogo.",
    "texto3":"Durante a jornada, encontramos e ajudamos diferentes NPCs que foram capturados e presos pelos monstros. Ao salvá-los, temos acesso às suas habilidades únicas em nossa caravana, que podemos acessar antes de cada fase. As fases são simples e os puzzles não são desafiadores, muitas vezes repetitivos. Os inimigos incluem monstros, monstros com capacetes, pássaros e pássaros com pernas, entre outros. Eles não são muito diversos e se repetem mesmo quando trocamos de mapa.",
    "texto4":"Em suma, Slash Quest tem um visual agradável e uma história cativante e personagens carismáticos, sendo uma boa opção para passar o tempo. No entanto, conta com inimigos repetitivos e é muito fácil.",
    "resumo": ""
  },
  
    {
      "id": 2,
      "titulo": "Elden Ring - Guia para Encontrar um Cajado e um Professor de Feitiçaria no Início do Jogo",
      "titulo2": "Tudo sobre Magia em Elden Ring",
      "texto": "Localizar um cajado em Elden Ring logo no início do jogo pode ser mais complicado do que parece. A menos que você tenha escolhido uma classe inicial específica, encontrar cajados para lançar feitiços pode ser um verdadeiro desafio. Para jogadores focados em combate corpo a corpo, isso não será um problema, mas para aqueles que preferem ataques à distância, essa busca é crucial, especialmente contra chefes como o Tree Sentinel.",
      "imagem1": "/assets/img/2/img1.png",
      "imagem6":"/assets/img/2/img6.png",
      "video": "",
      "imagem2": "",
      "autor": "Arthur",
      "tempo": "4",
      "data": "26/06/2024",
      "texto2": "Embora cajados possam ser adquiridos de vendedores e comerciantes conforme você avança na história principal, se você deseja encontrar um cajado logo no começo de Elden Ring - e um professor de feitiçaria para expandir seu repertório de feitiços - é importante saber onde procurar. Felizmente, esses itens não estão muito distantes e podem ser obtidos sem grande dificuldade.",
      "texto3": "Neste guia, abordaremos:\n1. Onde encontrar um cajado no início de Elden Ring\n2. Como equipar e usar feitiços com o cajado\n3. Localização do professor de feitiçaria em Elden Ring\n4. Onde encontrar o Royal House Scroll\n\nEncontrar um cajado no início de Elden Ring pode ser difícil, então você precisará ir a um local específico. Recomendamos explorar as Ruínas da Floresta Demi-Humana na Península das Lágrimas.",
      "texto4": "Esta área está localizada ao sul de Limgrave e pode ser acessada sem a necessidade de derrotar um chefe. Após desbloquear o cavalo Torrent, siga para o sudoeste de Limgrave e cruze a Ponte do Sacrifício. A área estará cheia de inimigos, mas se você for rápido, eles não devem ser um problema. Vale a pena verificar o cadáver do outro lado da ponte para obter a Chave de Pedra da Espada.",
      "texto5": "Em seguida, siga o caminho para o sul até que ele se divida em duas direções - sul e oeste. Recomendamos seguir primeiro para o sul, passar pelo comerciante e pegar o Fragmento de Mapa para facilitar a navegação. Depois, volte e siga para oeste.",
      "texto6": "A noroeste, você encontrará as Ruínas da Floresta Demi-Humana, onde está o cajado. Ao norte deste local, você encontrará a Rainha Demi-Humana. Apesar de seu tamanho e dos lacaios, essa batalha deve ser relativamente simples, desde que você tenha uma arma adequada e tenha melhorado suas estatísticas mínimas."
    }
  
  
]
